artillery-ddos/a.long.yml
config:
  target: "https://haydzo.codeby.com" #địa chỉ muốn test
  phases: #có thể  khai báo để chạy nhiều phases với thiết lập cụ thể khác nhau
    - duration: 5 #kéo dài trong 5s
      arrivalRate: 100 #trung bình 100 user/giây
      name: "Phase 1"
  processor: "./helper.js"       
scenarios: # lên kịch bản cho cho từng user
  - flow:
      - post:
          beforeRequest: setData
          url: "/facebook/webhook"
          json:
            object: page
            entry:
              - id: "106572561044026"
                time: "{{ currentTime }}"
                messaging:
                  - sender:
                      id: "2925857257501942"
                    recipient:
                      id: "106572561044026"
                    timestamp: "{{ currentTime }}"
                    message:
                      mid: m_6zwoOe3skVHmF2mx7WTtKnwak726S56rk0q098vZs4qacuWUQzZ319xC7w0kDhI33jzQtGMB_xVfaeQfkUU40g
                      text: "Time is = {{ currentTime }}"
