artillery-ddos/ngrok.yml
config:
  target: "https://ce0e0f3a6db5.ngrok.io"
  phases:
    - duration: 5
      arrivalRate: 1
  processor: "./ngrok.js"
scenarios:
  - name: "Register a user"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/users"
          headers:
            X-My-Header: "123"
          cookie:
            saved: "tapir,sloth"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - log: "Sent a request to /users with {{ name }}, {{ email }}, {{ password }}"